[
  {
    "year": "1985",
    "description": "Official opening of Starick House."
  },
  {
    "year": "1987",
    "description": "Joint production with Curtin University of 30 minutes video to increase awareness of domestic violence (DV) in the community."
  },
  {
    "year": "1988",
    "description": "Inception of HOWIC (Housing of Women in the Community).  Purchase of 3 units in the local area."
  },
  {
    "year": "1991",
    "description": "Pilot of 10-week support groups with Stirling Women's Refuge."
  },
  {
    "year": "1993",
    "description": "Piloting of a DV Intervention Project in the Armadale police region."
  },
  {
    "year": "1994",
    "description": "Official launch of Armadale Domestic Violence Intervention Project (ADVIP). \n HOWIC - purchase of two more properties."
  },
  {
    "year": "1995",
    "description": "SPEARS Court Support Program relocated to Armadale Police Station - first not for profit organisation in Australia to provide a DV outreach service within a police station."
  },
  {
    "year": "1996",
    "description": "SPEARS funded by the Department for Community Development."
  },
  {
    "year": "1997",
    "description": "Commenced provision of counselling services to women experiencing family and domestic violence (FDV)."
  },
  {
    "year": "1998",
    "description": "Funded by Department of Housing and Works to renovate/build Starick refuge."
  },
  {
    "year": "1999",
    "description": "Starick took over the management of Mary Smith Night Shelter."
  },
  {
    "year": "2000",
    "description": "Development of 'Strengthening the Heart' Project."
  },
  {
    "year": "2002",
    "description": "Establishment of Outreach service under the SPEARS Program for families leaving refuges in the South East Metro Corridor."
  },
  {
    "year": "2003",
    "description": "Family and Domestic Violence Advocate based at Cannington Police Station."
  },
  {
    "year": "2004",
    "description": "Family and Domestic Violence Advocate based at Gosnells Police Station. \n Counselling services relocated to Gosnells Community Lotteries House."
  },
  {
    "year": "2006",
    "description": "HOWIC - securing of two more properties. \n Agreement with Access Housing to provide accommodation and outreach services to the Eudoria Street Cluster Project."
  },
  {
    "year": "2009",
    "description": "New buildings added to Mary Smith Centre with funding from the Department of Housing. \n Starick Services Inc. restructured into the Centre for Non-Violence, Centre for Community and Centre for Safety and Wellbeing. \n Funded by Department for Child Protection (DCP) to operate the Laverton Crisis Intervention Service."
  },
  {
    "year": "2011",
    "description": "Funded by DCP under the 'Reconnecting Rural and Remote' program to manage the Family and Domestic Violence Case Management and Coordination Services for the Murchison/Gascoyne, Goldfields, and West/East Kimberley regions."
  },
  {
    "year": "2013",
    "description": "Refurbishment of Starick House with funding from Lotterywest. \n Funded to provide the 'Safe at Home' service."
  },
  {
    "year": "2016",
    "description": "Awarded funding by the DCP for the role of Lead Agency for the East Metro corridor to provide 24/7 response to women and children at imminent risk of harm."
  },
  {
    "year": "2017",
    "description": "Starick Op Shop holds its first giant garage sale and raises over $1,000. \n Commencement of playground refurbishment at both refuges."
  },
  {
    "year": "2018",
    "description": "Refurbishment with funding support from Lotterywest and 40th Birthday of Mary Smith Refuge."
  }
]
